[source::WinEventLog:Security]
###### 1. EXTRACT           ######
EXTRACT-000_CIM_user_domain = (?s)Subject\:.*?Account\sName\:\s+(?<src_user>[^\n]+)\n\s+Account\sDomain\:\s+(?<src_nt_domain>[^\n]+).*?Account\sName\:\s+(?<user>[^\n]+)(?:\n\s+Account\sDomain\:\s+(?<dest_nt_domain>[^\n]+)|\n)
EXTRACT-001_CIM_user_domain = (?s)Subject\:.*?Account\sName\:\s+(?<user>[^\n]+)\n\s+Account\sDomain\:\s+(?<dest_nt_domain>[^\n]+)
EXTRACT-002_CIM_logon_logoff = EventCode\=(?:4611|4672)\n(?:.+\n){7}Message\=[^\:]+\:\n\t+[^\:]+\:\t+(?<src_sec_id>[^\n]*)\n\t+[^\:]+\:\t+(?<src_user>[^\n]*)\n\t+[^\:]+\:\t+(?<src_domain>[^\n]*)\n\t+[^\:]+\:\t+(?<src_logon_id>[^\n]*)(?:\n\t+[^\:]+\:\t+(?<src_logon_guid>[^\n]*)|\n)
EXTRACT-003_CIM_logon_logoff = EventCode\=(?:4624|4625|4647)\n(?:.+\n){7}Message\=[^\n]+\n\n[^\:]+\:\n\s+[^\:]+\:\s+(?<src_sec_id>[^\n]*)\n\s+[^\:]+\:\s+(?<src_user>[^\n]*)\n\s+[^\:]+\:\s+(?<src_nt_domain>[^\n]*)\n\s+[^\:]+\:\s+(?<src_logon_id>[^\n]*)(?:\n\n[^\:]+\:\s+(?<Logon_Type>[^\n]*)(?:(?:[^\:]+\:\s+(?<Impersonation_Level>[^\n]*)\n\n[^\:]+\:\n|[^\:]+\:\n)\s+[^\:]+\:\s+(?<dest_sec_id>[^\n]+)\n\s+[^\:]+\:\s+(?<dest_user>[^\n]*)\n\s+[^\:]+\:\s+(?<dest_nt_domain>[^\n]*)(?:\n\s+[^\:]+\:\s+(?<dest_logon_id>[^\n]*)\n\s+[^\:]+\:\s+(?<dest_logon_guid>[^\n]*)|\n)|$)|$)
EXTRACT-004_CIM_logon_logoff = EventCode\=(?:4648)\n(?:.+\n){7}Message\=[^\n]+\n\n[^\:]+\:\n\t+[^\:]+\:\t+(?<src_sec_id>[^\n]*)\n\t+[^\:]+\:\t+(?<src_user>[^\n]*)\n\t+[^\:]+\:\t+(?<src_nt_domain>[^\n]*)\n\t+[^\:]+\:\t+(?<src_logon_id>[^\n]*)\n\t+[^\:]+\:\t+(?<src_logon_guid>[^\n]*)\n\n[^\:]+\:\n\t+(?<dest_user>[^\n]*)\n\t+[^\:]+\:\t+(?<dest_nt_domain>[^\n]*)\n\t+(?<dest_logon_guid>[^\n]*)
EXTRACT-005_CIM_auth_signature_id = EventCode\=(?<signature_id>\d+)
EXTRACT-006_CIM_change_result_id = EventCode\=(?<result_id>\d+)
###### 2. REPORT            ######
REPORT-dest_nt_domain_for_windows_security = Target_Domain_as_dest_nt_domain,Primary_Domain_as_dest_nt_domain,Group_Domain_as_dest_nt_domain,Account_Domain_as_dest_nt_domain,New_Domain_as_dest_nt_domain,Domain_as_dest_nt_domain,User_ID_as_dest_nt_domain,Security_ID_as_dest_nt_domain,Supplied_Realm_Name_as_dest_nt_domain,Target_Account_ID_as_dest_nt_domain
REPORT-Process_Command_Line_info = Process_Command_Line_info,Process_Command_Line_info_NL,powershell_base64,script_info_from_process_parameters,powershell_remote_script,Process_path_exe,Process_path_exe_NL,Parent_process_dir_exe
REPORT-object_name_to_path_and_file = object_name_to_path_and_file
###### 3. AUTO KEY-VALUE    ######
KV_MODE = auto
###### 4. FIELDALIAS        ######
FIELDALIAS-01_Windows_NL_to_EN = Aanmeldings_GUID ASNEW Logon_GUID Aanmeldings_id ASNEW Logon_ID Aanmeldingsaccount ASNEW Logon_Account Aanmeldingsproces ASNEW Logon_Process Aanmeldingstype ASNEW Logon_Type Aantal_elementen ASNEW Number_of_Elements Aanvullende_gegevens ASNEW Additional_Information Accountdomein ASNEW Account_Domain Accountnaam ASNEW Account_Name Beleids_id ASNEW Policy_ID Bestandsnaam ASNEW File_Name Beveiligings_id ASNEW Security_ID Bevoegdheden ASNEW Privileges Bewerking ASNEW Operation Bronnaam ASNEW Source_Name Bronwerkstation ASNEW Source_Workstation De_naam_van_het_berichtgevingspakket_is ASNEW Notification_Package_Name Domein_van_groep ASNEW Group_Domain Doorgezette_services ASNEW Transited_Services Foutcode ASNEW Error_Code Gebeurtenisbron_id ASNEW Event_Source_ID Id_van_nieuw_proces ASNEW New_Process_ID Imitatieniveau ASNEW Impersonation_Level Ingangs_id ASNEW Handle_ID Naam ASNEW Name Naam_aanmeldingsproces ASNEW Logon_Process_Name Naam_algoritme ASNEW Algorithm_Name Naam_beveiligingspakket ASNEW Security_Package_Name Naam_proces ASNEW Process_Name Naam_provider ASNEW Provider_Name Naam_servicebestand ASNEW Service_File_Name Naam_van_doelserver ASNEW Target_Server_Name Naam_van_groep ASNEW Group_Name Naam_van_nieuw_proces ASNEW New_Process_Name Naam_van_werkstation ASNEW Workstation_Name Netwerkadres ASNEW Network_Address Netwerkadres_van_bron ASNEW Source_Network_Address Nieuwe_security_descriptor ASNEW New_Security_Descriptor Nieuwe_tijd ASNEW New_Time Objectnaam ASNEW Object_Name Objectserver ASNEW Object_Server Objecttype ASNEW Object_Type Oorspronkelijke_security_descriptor ASNEW Original_Security_Descriptor Opdrachtregel_proces ASNEW Process_Command_Line Opgegeven_accountnaam__niet_geverifieerd_ ASNEW Provided_Account_Name__unauthenticated_ Pakketnaam__alleen_NTLM_ ASNEW Package_Name__NTLM_only_ Poort ASNEW Port Poort_van_bron ASNEW Source_Port Proces_id ASNEW Process_ID Proces_id_van_maker ASNEW Creator_Process_ID Procesnaam ASNEW Process_Name Retourcode ASNEW Return_Code Serviceaccount ASNEW Service_Account Servicenaam ASNEW Service_Name Servicetype ASNEW Service_Type Sleutellengte ASNEW Key_Length Sleutelnaam ASNEW Key_Name Sleuteltype ASNEW Key_Type Starttype_van_service ASNEW Service_Start_Type Statuscode ASNEW Status_Code Substatus ASNEW Sub_Status Type_tokenverhoging ASNEW Token_Elevation_Type Verificatiepakket ASNEW Authentication_Package Vorige_tijd ASNEW Previous_Time Werkstation_van_aanroeper ASNEW Caller_Workstation
FIELDALIAS-02_CIM = subject_user ASNEW src_user target_user ASNEW user subject_domain ASNEW src_nt_domain target_domain ASNEW dest_nt_domain Logon_Account ASNEW src_user Creator_Process_ID ASNEW parent_process_id Creator_Process_Name ASNEW parent_process_path
FIELDALIAS-body_for_windows_security2 = Message ASNEW body
FIELDALIAS-src_port_for_windows_security2 = Source_Port ASNEW src_port
###### 5. EVAL              ######
EVAL-Status = lower(Status)
EVAL-Sub_Status = lower(Sub_Status)
EVAL-action = case(EventCode=="4663" AND (Access_Mask=="0x20" AND (isnull(object_file) OR object_file="") AND (isnull(object_file_hidden) OR object_file_hidden="")),"traverse", EventCode=="4663" AND (Access_Mask=="0x20" AND (isnotnull(object_file) OR object_file!="" OR isnotnull(object_file_hidden) OR object_file_hidden!="")),"execute", isnotnull(action),action)
EVAL-app = case(Logon_Type=="2" AND EventCode=="4634","win:logoff:interactive", Logon_Type=="3" AND EventCode=="4634","win:logoff:network", Logon_Type=="4" AND EventCode=="4634","win:logoff:batch", Logon_Type=="5" AND EventCode=="4634","win:logoff:service", Logon_Type=="7" AND EventCode=="4634","win:logoff:unlock", Logon_Type=="8" AND EventCode=="4634","win:logoff:networkcleartext", Logon_Type=="9" AND EventCode=="4634","win:logoff:newcredentials", Logon_Type=="10" AND EventCode=="4634","win:logoff:remoteinteractive", Logon_Type=="11" AND EventCode=="4634","win:logoff:cachedinteractive", Logon_Type=="2","win:logon:interactive", Logon_Type=="3","win:logon:network", Logon_Type=="4","win:logon:batch", Logon_Type=="5","win:logon:service", Logon_Type=="7","win:logon:unlock", Logon_Type=="8","win:logon:networkcleartext", Logon_Type=="9","win:logon:newcredentials", Logon_Type=="10","win:logon:remoteinteractive", Logon_Type=="11","win:logon:cachedinteractive", EventCode=="4648" OR EventCode=="552","win:logon:remote", EventCode=="4776","win:logon", EventCode>="4768" AND EventCode<="4773","win:logon:kerb", EventCode>="4727" AND EventCode<="4737","win:group", true(),"win:unknown")
EVAL-command = case(EventCode=="4719" AND match(Account_Name,".*\$"),"group policy", EventCode=="4719","auditpol", true(),command)
EVAL-dest = if(isnull(dest) OR dest=="", replace(ComputerName, "^([^\.]+)(.*)", "\1"), dest)
EVAL-dest_nt_domain = case((EventCode=="4732" OR EventCode=="4733"),Group_Domain, isnull(dest_nt_domain) OR dest_nt_domain=="", replace(ComputerName, "^([^\.]+)\.([^\.]+)(.*)", "\2"), true(),dest_nt_domain)
EVAL-login_failure_reason = if(isnull(sub_status_desc) OR sub_status_desc=="", status_desc, sub_status_desc)
EVAL-object = case(EventCode=="4663",coalesce(object_file,object_file_hidden), EventCode=="4719",Category." >> ".Subcategory, EventCode=="4740",Account_Domain."\\".mvindex(Account_Name,1), (EventCode>=4727 AND EventCode<=4737) OR (EventCode>=4744 AND EventCode<=4763),coalesce(Group_Domain,mvindex(Account_Domain,1))."\\".coalesce(Group_Name,mvindex(Account_Name,2)), (EventCode==5136 OR EventCode==5141),DN, EventCode==5137,Name, EventCode==5139,Old_DN, EventCode==4781,Old_Account_Name, mvcount(Account_Name)==2,mvindex(Account_Domain,1)."\\".mvindex(Account_Name,1), isnotnull(object),object)
EVAL-object_attrs = case(EventCode=="4719",split(Changes,", "), EventCode=="4723" OR EventCode=="4724","password", EventCode=="4727","sAMAccountName", in(EventCode,"4728","4729","4732","4733","4746","4747","4751","4752","4756","4757","4761","4762"),"member", EventCode=="5136",LDAP_Display_Name, EventCode=="5137",Class, isnotnull(object_attrs), object_attrs)
EVAL-object_category = case(EventCode=="4663" AND (isnull(object_file) OR object_file="") AND (isnull(object_file_hidden) OR object_file_hidden=""),"directory", EventCode=="4663" AND (isnotnull(object_file) OR object_file!="" OR isnotnull(object_file_hidden) OR object_file_hidden!=""),"file", isnotnull(object_category),object_category, (EventCode=="5136" OR EventCode=="5137" OR EventCode=="5139" OR EventCode=="5141"), Class, EventCode=="5140",Object_Type, (mvcount(Account_Name)>1 AND substr(mvindex(Account_Name,1),-1)=="$"),"computer")
EVAL-object_id = case(EventCode=="4719",Subcategory_GUID, (EventCode=="4730" OR EventCode=="4732" OR EventCode=="4733"),mvindex(Security_ID,2), (EventCode=="5136" OR EventCode=="5139" OR EventCode=="5141"),GUID, EventCode=="4781",mvindex(Security_ID,1), mvcount(Account_Name)>1,mvindex(Security_ID,1), isnotnull(object_id),object_id, mvcount(Account_Name)==1,Security_ID)
EVAL-process_integrity_level = case(Mandatory_Label=="S-1-16-0","untrusted", Mandatory_Label=="S-1-16-4096","low", Mandatory_Label=="S-1-16-8192","medium", Mandatory_Label=="S-1-16-8448","medium-high", Mandatory_Label=="S-1-16-12288","high", Mandatory_Label=="S-1-16-16384","system", Mandatory_Label=="S-1-16-20480","protected", (Token_Elevation_Type=="%%1936" OR Token_Elevation_Type=="TokenElevationTypeDefault (1)") AND (Security_ID=="S-1-5-18" OR Security_ID=="S-1-5-19" OR Security_ID=="S-1-5-20"),"system", (Token_Elevation_Type=="%%1936" OR Token_Elevation_Type=="TokenElevationTypeDefault (1)"),"high", (Token_Elevation_Type=="%%1937" OR Token_Elevation_Type=="TokenElevationTypeFull (2)"),"high", (Token_Elevation_Type=="%%1937" OR Token_Elevation_Type=="TokenElevationTypeLimited (3)"),"low", true(),process_integrity_level)
EVAL-process_path = process_current_directory.process_exec
EVAL-result = case(EventCode=="4771" AND Failure_Code=="0x12","lockout", EventCode=="4663" AND isnotnull(object_file) AND Access_Mask=="0x1","FILE_READ_DATA", EventCode=="4663" AND isnull(object_file) AND Access_Mask=="0x1","FILE_LIST_DIRECTORY", EventCode=="4663" AND isnotnull(object_file) AND Access_Mask=="0x2","FILE_WRITE_DATA", EventCode=="4663" AND isnull(object_file) AND Access_Mask=="0x2","FILE_ADD_FILE", EventCode=="4663" AND isnotnull(object_file) AND Access_Mask=="0x4","FILE_APPEND_DATA", EventCode=="4663" AND isnull(object_file) AND Access_Mask=="0x4","FILE_ADD_SUBDIRECTORY", EventCode=="4663" AND Access_Mask=="0x8","FILE_READ_EA", EventCode=="4663" AND Access_Mask=="0x10","FILE_WRITE_EA", EventCode=="4663" AND isnotnull(object_file) AND Access_Mask=="0x20","FILE_EXECUTE", EventCode=="4663" AND isnull(object_file) AND Access_Mask=="0x20","FILE_TRAVERSE", EventCode=="4663" AND Access_Mask=="0x40","FILE_DELETE_CHILD", EventCode=="4663" AND Access_Mask=="0x80","FILE_READ_ATTRIBUTES", EventCode=="4663" AND Access_Mask=="0x100","FILE_WRITE_ATTRIBUTES", EventCode=="4663" AND Access_Mask=="0x10000","DELETE", EventCode=="4663" AND Access_Mask=="0x20000","READ_CONTROL", EventCode=="4663" AND Access_Mask=="0x40000","WRITE_DAC", EventCode=="4663" AND Access_Mask=="0x80000","WRITE_OWNER", EventCode=="4663" AND Access_Mask=="0x100000","SYNCHRONIZE", EventCode=="5136",Type, EventCode=="5139", New_DN, isnull(result) AND isnotnull(signature),signature, 1==1,result)
EVAL-result_id = case(EventCode=="4663",Access_Mask, isnull(result_id),EventCode, 1==1,result_id)
EVAL-signature_id = case(isnull(signature_id),EventCode, 1==1,signature_id)
EVAL-src = case(isnotnull(Workstation_Name) AND Workstation_Name!="-",Workstation_Name, isnotnull(Source_Workstation) AND Source_Workstation!="-",Source_Workstation, isnotnull(Source_Network_Address) AND Source_Network_Address!="-",Source_Network_Address, isnotnull(Client_Address) AND Client_Address!="-",Client_Address, isnotnull(Source_Address) AND Source_Address!="-",Source_Address, isnotnull(Client_Machine_Name) AND Client_Machine_Name!="-",Client_Machine_Name, isnotnull(Caller_Machine_Name) AND Caller_Machine_Name!="-",Caller_Machine_Name, isnotnull(Caller_Computer_Name) AND Caller_Computer_Name!="-",Caller_Computer_Name, isnull(src) AND isnotnull(src_ip),src_ip, isnotnull(ComputerName) AND ComputerName!="-",ComputerName)
EVAL-src_user = case(EventCode==4781,lower(Account_Name), in(EventCode,"4728","4729","4732","4733","4746","4747","4751","4752","4756","4757","4761","4762"),mvindex(Account_Name,0), mvcount(Account_Name)>1 AND mvindex(Account_Name,0)=="-" AND mvindex(Security_ID,0)=="S-1-0-0","Null SID", mvcount(Account_Name)>1 AND mvindex(Account_Name,0)=="-" AND mvindex(Security_ID,0)=="S-1-5-7","Anonymous", mvcount(Account_Name)>1 AND mvindex(Account_Name,0)=="-" AND mvindex(Security_ID,0)=="S-1-5-17","Default IIS user", mvcount(Account_Name)>1 AND mvindex(Account_Name,0)=="-" AND mvindex(Security_ID,0)=="S-1-5-18","Local System", mvcount(Account_Name)>1 AND mvindex(Account_Name,0)=="-" AND mvindex(Security_ID,0)=="S-1-5-19","NT Authority/Local Service", mvcount(Account_Name)>1 AND mvindex(Account_Name,0)=="-" AND mvindex(Security_ID,0)=="S-1-5-20","NT Authority/Network Service", mvcount(Account_Name)>1 AND mvindex(Account_Name,0)=="-","",  mvcount(Account_Name)>1 AND mvindex(Account_Name,0)!="-",lower(mvindex(Account_Name,0)), true(),lower(src_user))
EVAL-src_user_logon_id = case(mvcount(Logon_ID)>1,mvindex(Logon_ID,0), true(),null())
EVAL-src_user_sid = case(mvcount(Security_ID)>1,mvindex(Security_ID,0), true(),null())
EVAL-src_nt_domain = case(EventCode=="4771",upper(replace(replace(Service_Name,".*\/", ""),"([^\.]+)(.*)","\1")), isnull(src_nt_domain),dest_nt_domain, 1==1,src_nt_domain)
EVAL-status = action
EVAL-status_code = case(EventCode=="4625" AND (Sub_Status=="0x0" OR len(Sub_Status)<10),Status, EventCode=="4625" AND Sub_Status!="0x0",Sub_Status, EventCode=="4697",Service_Type, isnotnull(Failure_Code),Failure_Code, isnotnull(Error_Code),Error_Code,  isnotnull(Result_Code),Result_Code, isnotnull(Access_Mask),Access_Mask, true(),"-")
EVAL-user = case(EventCode==4781,lower(New_Account_Name), EventCode==4688 AND (mvindex(Account_Name,1)=="-" OR mvcount(Account_Name)==1),mvindex(Account_Name,0), mvcount(Account_Name)>1 AND mvindex(Account_Name,1)=="-" AND mvindex(Security_ID,1)=="S-1-0-0","Null SID", mvcount(Account_Name)>1 AND mvindex(Account_Name,1)=="-" AND mvindex(Security_ID,1)=="S-1-5-7","Anonymous", mvcount(Account_Name)>1 AND mvindex(Account_Name,1)=="-" AND mvindex(Security_ID,1)=="S-1-5-17","Default IIS user", mvcount(Account_Name)>1 AND mvindex(Account_Name,1)=="-" AND mvindex(Security_ID,1)=="S-1-5-18","Local System", mvcount(Account_Name)>1 AND mvindex(Account_Name,1)=="-" AND mvindex(Security_ID,1)=="S-1-5-19","NT Authority/Local Service", mvcount(Account_Name)>1 AND mvindex(Account_Name,1)=="-" AND mvindex(Security_ID,1)=="S-1-5-20","NT Authority/Network Service", mvcount(Account_Name)>1 AND mvindex(Account_Name,1)=="-","no user found", mvcount(Account_Name)>1,lower(mvindex(Account_Name,1)),mvcount(Account_Name)==1 AND Account_Name=="-","no user found", mvcount(Account_Name)==1 AND Account_Name!="-",lower(Account_Name), true(),lower(user))
EVAL-user_logon_id = case(mvcount(Logon_ID)>1,mvindex(Logon_ID,1), 1==1,Logon_ID)
EVAL-user_sid = case(mvcount(Security_ID)>1,mvindex(Security_ID,1), 1==1,Security_ID)
###### 6. LOOKUP            ######
LOOKUP-01_windows_signature_lookup = windows_signature_extended EventCode status_code OUTPUTNEW signature,CategoryString,action,result,change_type,object_category
LOOKUP-10_userAccountControl_lookup = userAccountControl userAccountControl OUTPUTNEW UAC_explanation
LOOKUP-11_4738_old_uac_lookup = userAccountControl hex AS Old_UAC_Value OUTPUTNEW UAC_explanation AS Old_UAC_Value_expl
LOOKUP-12_4738_new_uac_lookup = userAccountControl hex AS New_UAC_Value OUTPUTNEW UAC_explanation AS New_UAC_Value_expl
###### 7. OTHER STUFF       ######

[source::WinEventLog:Microsoft-Windows-PowerShell/Operational]
###### 1. EXTRACT           ######
EXTRACT-ScriptBlock_ID_and_Path = ScriptBlock\sID\:\s+(?<ScriptBlock_ID>[^\n]*)\nPath\:\s+(?<Path>[^\n]*)
###### 2. REPORT            ######
REPORT-script_file_from_path = powershell_script_file_from_path,script_content_from_message
###### 3. AUTO KEY-VALUE    ######
KV_MODE = none
###### 4. FIELDALIAS        ######
###### 5. EVAL              ######
###### 6. LOOKUP            ######
###### 7. OTHER STUFF       ######

[ActiveDirectory]
###### 1. EXTRACT           ######
###### 2. REPORT            ######
###### 3. AUTO KEY-VALUE    ######
###### 4. FIELDALIAS        ######
###### 5. EVAL              ######
###### 6. LOOKUP            ######
LOOKUP-10_userAccountControl_lookup = userAccountControl userAccountControl OUTPUTNEW UAC_explanation
###### 7. OTHER STUFF       ######
SEDCMD-remove_ms-mcs-AdmPwd = s/ms-Mcs-AdmPwd\=([^\s]+)/ms-Mcs-AdmPwd=**MASKED**/g

[source::WinEventLog:System]
###### 1. EXTRACT           ######
EXTRACT-WindowsServiceControl = (?s)SourceName\=Microsoft\-Windows\-Service.*The(?:\s+start\s+type\s+of\s+the\s+|\s+)(?<service>.*)\s+service\s+(?:entered\s+the\s+(?<status>.*)\s+state|was\s+changed\s+from\s+(?<start_mode_old>.*)\s+start\s+to\s+(?<start_mode>.*)\s+start)
EXTRACT-WindowsServiceControl_NL = (?s)SourceName\=Microsoft\-Windows\-Service.*(?:Het|De)(?:\sopstarttype\svan\sde\sservice\s|\s+)(?<service>.*)(?:is\sgewijzigd\svan\s(?<start_mode_old>.*)(?:\sin\s(?<start_mode>[^\.]+))|\-service\sheeft\snu\sde\sstatus\s(?<status>[^\.]+))
EXTRACT-WindowsUpdate_info = Installation\s*(?<install_status>\w+)\:\s(?:.*)following\supdate(?:\:\s|\swith\serror\s(?<error_code>[^\:]+)\:\s)(?<signature>.*)(?:\s\-\s(?=KB)|\s\-\s|\((?=KB))(?<signature_id>.*)
EXTRACT-WindowsUpdate_info_KB_first = Installation\s*(?<install_status>\w+)\:\s(?:.*)following\supdate(?:\:\s|\swith\serror\s(?<error_code>[^\:]+)\:\s)(?<signature_id>KB[^\:]+)\:\s(?<signature>.*)
EXTRACT-WindowsUpdate_info_NL = Installatie\s*(?<install_status>\w+)\:\s+(?:.*)de\svolgende\supdate.*?(?:\:\s|foutcode\s(?<error_code>[^\:]+)\:\s)(?<signature>.*)(?:\s\-\s(?=KB)|\s\-\s|\((?=KB))(?<signature_id>.*)
EXTRACT-WindowsUpdate_info_NL_KB_first = Installatie\s*(?<install_status>\w+)\:\s+(?:.*)de\svolgende\supdate.*?(?:\:\s|foutcode\s(?<error_code>[^\:]+)\:\s)(?<signature_id>KB[^\:]+)\:\s(?<signature>.*)
###### 2. REPORT            ######
###### 3. AUTO KEY-VALUE    ######
###### 4. FIELDALIAS        ######
FIELDALIAS-WineventlogSystem_CIM = host AS dest
FIELDALIAS-System_to_Security = Sid AS Security_ID
###### 5. EVAL              ######
EVAL-install_status = case(install_status=="voltooid","successful", install_status=="fout","failure", true(),lower(install_status))
EVAL-signature_id = case(match(TaskCategory,"Windows Update.*"),replace(signature_id, "(KB\d+).*?(?!\))(.*?)(?:\.$|$)", "\1\2"), true(),signature_id)
EVAL-start_mode = case((trim(start_mode,".")=="auto start" OR trim(start_mode,".")=="boot start" OR trim(start_mode,".")=="automatisch starten" OR trim(start_mode,".")=="system start"),"auto", (trim(start_mode,".")=="starten op aanvraag" OR trim(start_mode,".")=="demand start"),"manual", (trim(start_mode,".")=="disabled" OR trim(start_mode,".")=="uitgeschakeld"),"disabled", true(),trim(start_mode,"."))
EVAL-start_mode_old = case((start_mode_old=="auto start" OR start_mode_old=="boot start" OR start_mode_old=="automatisch starten" OR start_mode_old=="system start"),"auto", (start_mode_old=="starten op aanvraag" OR start_mode_old=="demand start"),"manual", (start_mode_old=="disabled" OR start_mode_old=="uitgeschakeld"),"disabled", true(),start_mode_old)
EVAL-status = case(match(TaskCategory,"(?i)Windows Update.Agent") AND (EventCode==17 OR EventCode==18),"available", match(TaskCategory,"(?i)Windows Update.Agent") AND EventCode==19,"installed", match(TaskCategory,"(?i)Windows Update.Agent") AND (EventCode==20 OR EventCode==24 OR EventCode==31 OR EventCode==33),"error", match(TaskCategory,"(?i)Windows Update.Agent") AND (EventCode==21 OR EventCode==22),"restart_required", match(TaskCategory,"(?i)Windows Update.Agent") AND EventCode==23,"uninstalled", SourceName=="Microsoft-Windows-Service Control Manager" AND (status=="running" OR status=="wordt uitgevoerd"),"started", SourceName=="Microsoft-Windows-Service Control Manager" AND (status=="stopped" OR status=="paused" OR status=="gestopt" OR status=="onderbroken"),"stopped", true(),status)
EVAL-user = case(Security_ID=="S-1-0-0","Null SID", Security_ID=="S-1-5-7","Anonymous", Security_ID=="S-1-5-17","Default IIS user", Security_ID=="S-1-5-18","Local System", Security_ID=="S-1-5-19","NT Authority/Local Service", Security_ID=="S-1-5-20","NT Authority/Network Service", 1==1,lower(user))
###### 6. LOOKUP            ######
###### 7. OTHER STUFF       ######

[source::WinEventLog:Application]
###### 1. EXTRACT           ######
EXTRACT-WindowsUpdate_Apps = Product\:\s+(?<product>.*?)\s+\-\s+Update\s+\'(?<signature_long>[^\']+)\'\sis\s(?<status>[^\.]+)
EXTRACT-eventcode_1033_1034 = (?s)EventCode\=103[3|4].*Product\sName\:\s+(?<Product_Name>.*?)\.\sProduct\sVersion\:\s(?<Product_Version>.*?)\.\sProduct\sLanguage\:\s(?<Product_Language>.*?)\.\sManufacturer\:\s(?<Manufacturer>.*?)\.\s(?<action>Installation|Removal)\ssuccess\sor\serror\sstatus\:\s(?<error_status>.*?)\.$
###### 2. REPORT            ######
REPORT-Application_Transforms = signature_id_from_signature_long
###### 3. AUTO KEY-VALUE    ######
###### 4. FIELDALIAS        ######
###### 5. EVAL              ######
EVAL-status = case(status=="geïnstalleerd","installed", true(),status)
###### 6. LOOKUP            ######
###### 7. OTHER STUFF       ######

[(?::){0}WinEventLog...]
###### 1. EXTRACT           ######
###### 2. REPORT            ######
###### 3. AUTO KEY-VALUE    ######
###### 4. FIELDALIAS        ######
###### 5. EVAL              ######
###### 6. LOOKUP            ######
###### 7. OTHER STUFF       ######
## Remove the default text from EventCodes 4616/4624/4625/4634/4647/4648/4688/4768/...
## without this default text you win almost as much as with the XML version, but you keep all the fields and keep the events human readable 
## this part needs to be placed where the data is processed, this is either a heavy forwarder or a indexer.
SEDCMD-clean_fluff_from_winsec_events_this_event = s/This event is generated[\S\s\r\n]+$//g
SEDCMD-clean_fluff_from_winsec_events_token_elevation = s/Token Elevation Type indicates[\S\s\r\n]+$//g
SEDCMD-clean_fluff_from_winsec_events_certificate_info = s/Certificate information is only provided if[\S\s\r\n]+$//g
SEDCMD-clean_fluff_from_winsec_events_the_subject_fields = s/The subject fields indicate the account[\S\s\r\n]+$//g
## And the same for the dutch Windows
SEDCMD-clean_fluff_from_winsec_events_deze_gebeurtenis = s/Deze gebeurtenis wordt gegenereerd wanneer[\S\s\r\n]+$//g
SEDCMD-clean_fluff_from_winsec_events_type_tokenverhoging = s/Type tokenverhoging geeft[\S\s\r\n]+$//g
SEDCMD-clean_fluff_from_winsec_events_certificaat_info= s/Certificaat informatie wordt alleen verstrekt indien[\S\s\r\n]+$//g
## Remove the ipv6 indication in an ipv4 address
SEDCMD-remove_ffff = s/::ffff://g