# Lookup file for the monitored groups dashboard
[monitored_groups]
filename = monitored_groups.csv
case_sensitive_match = false

# Lookup file for the legit powershell scripts that run in the enviroment
[legit_powershell_scripts]
filename = legit_powershell_scripts.csv
case_sensitive_match = false

[windows_signature_extended]
filename = windows_signature_extended.csv
case_sensitive_match = false

# Lookup for legacy windows eventcodes
[windows_legacy_signature_extended]
filename = windows_legacy_signature_extended.csv
case_sensitive_match = false

# Lookup file with the userAccountControl status that can be found in the admon data
# This file gives a explanation about what the number means
[userAccountControl]
filename = userAccountControl.csv
case_sensitive_match = false

# Lookup file with all the NTStatus values that you find in the eventlogs.
# for example the EventCode 4625 (failed logon) has a field named "Status" and "Sub_Status" with these codes
# taken from https://msdn.microsoft.com/en-us/library/cc704588.aspx :
## By combining the NTSTATUS into a single 32-bit numbering space, the following NTSTATUS values are defined. 
## Most values also have a defined default message that can be used to map the value to a human-readable text message. 
## When this is done, the NTSTATUS value is also known as a message identifier.
## This document provides the common usage details of the NTSTATUS values; individual protocol specifications may provide expanded or modified definitions.
## In the following descriptions, a percentage sign that is followed by one or more alphanumeric characters (for example, "%1" or "%hs") 
## indicates a variable that is replaced by text at the time the value is returned.
[windows_hex_codes]
filename = windows_hex_codes.csv
case_sensitive_match = false

# Lookup file equal to the windows_signature_extended but now for the application logs .
# This will most likely be just just for events that are ingested in the datamodels.
[windows_signature_application]
batch_index_query = false
case_sensitive_match = false
filename = windows_signature_application.csv
match_type = WILDCARD(SourceName)

# The default regex for the below 10 *_as_dest_nt_domain stanza is not correct for EventCodes that have more than one Account_Domain field. 
# The Target Domain is always the second field, the default regex takes in case of two fields everything and not just the last one.
[Target_Domain_as_dest_nt_domain]
SOURCE_KEY = Target_Domain
REGEX = [\-\sa-zA-Z0-9]*(?:(?:\s)(.*))|(.*)
FORMAT = dest_nt_domain::"$1"

[Primary_Domain_as_dest_nt_domain]
SOURCE_KEY = Primary_Domain
REGEX = [\-\sa-zA-Z0-9]*(?:(?:\s)(.*))|(.*)
FORMAT = dest_nt_domain::"$1"

[Group_Domain_as_dest_nt_domain]
SOURCE_KEY = Group_Domain
REGEX = [\-\sa-zA-Z0-9]*(?:(?:\s)(.*))|(.*)
FORMAT = dest_nt_domain::"$1"

[Account_Domain_as_dest_nt_domain]
SOURCE_KEY = Account_Domain
REGEX = [\-\sa-zA-Z0-9]*(?:(?:\s)(.*))|(.*)
FORMAT = dest_nt_domain::"$1"

[New_Domain_as_dest_nt_domain]
SOURCE_KEY = New_Domain
REGEX = [\-\sa-zA-Z0-9]*(?:(?:\s)(.*))|(.*)
FORMAT = dest_nt_domain::"$1"

[Domain_as_dest_nt_domain]
SOURCE_KEY = Domain
REGEX = [\-\sa-zA-Z0-9]*(?:(?:\s)(.*))|(.*)
FORMAT = dest_nt_domain::"$1"

[User_ID_as_dest_nt_domain]
SOURCE_KEY = User_ID
REGEX = [\-\sa-zA-Z0-9]*(?:(?:\s)(.*))|(.*)
FORMAT = dest_nt_domain::"$1"

[Security_ID_as_dest_nt_domain]
SOURCE_KEY = Security_ID
REGEX = [\-\sa-zA-Z0-9]*(?:(?:\s)(.*))|(.*)
FORMAT = dest_nt_domain::"$1"

[Supplied_Realm_Name_as_dest_nt_domain]
SOURCE_KEY = Supplied_Realm_Name
REGEX = [\-\sa-zA-Z0-9]*(?:(?:\s)(.*))|(.*)
FORMAT = dest_nt_domain::"$1"

[Target_Account_ID_as_dest_nt_domain]
SOURCE_KEY = Target_Account_ID
REGEX = [\-\sa-zA-Z0-9]*(?:(?:\s)(.*))|(.*)
FORMAT = dest_nt_domain::"$1"

[powershell_base64]
CLEAN_KEYS = false
REGEX = (?i)(?:^|\s+)(?:\-e(?![xq].{0,2})(?=[encodma]+)[^\s]*)\s*(?<base64_encoded>[^\s]*)
SOURCE_KEY = process_parameters

[powershell_script_file_from_path]
SOURCE_KEY = Path
CLEAN_KEYS = false
REGEX = (?=\w\:\\)(?<script_location>.*\\)(?!\\)(?<script_file>[^\\\/\:\*\?\"\<\>\|]+\.(?:psc1|ps1|ps|bat|vbs|vbe|vbscript|vb|ws|wsf|wsh))

[script_content_from_message]
SOURCE_KEY = Message
CLEAN_KEYS = false
REGEX = Creating\s*Scriptblock\s*text\s*\(\d+\s*of\s*\d+\)\:\s*(?<script_content>.*)ScriptBlock\s*ID\:

[powershell_remote_script]
CLEAN_KEYS = false
REGEX = (?i)\.downloadstring\(\'(?<remote_script>[^\']*)
SOURCE_KEY = process_parameters

[Process_Command_Line_info]
CLEAN_KEYS = false
MV_ADD = false
SOURCE_KEY = Process_Command_Line
FORMAT = powershell_script::$1 process_command::$2 process_command::$4 process_command::$6 process_command::$8 process_command::$9 process_parameters::$3 process_parameters::$5 process_parameters::$7
REGEX = ^(.*)\|(?=(?i)\s*powershell)([^\s]+)\s*(.*)|^\"([^\"]*)\"\s(.*)|^(?!\")([^\s]*)\s(.*)|^\"(.*)\"|^(.*)

[Process_Command_Line_info_NL]
CLEAN_KEYS = false
FORMAT = powershell_script::$1 process_command::$2 process_command::$4 process_command::$6 process_command::$8 process_command::$9 process_parameters::$3 process_parameters::$5 process_parameters::$7
REGEX = ^(.*)\|(?=(?i)\s*powershell)([^\s]+)\s*(.*)|^\"([^\"]*)\"\s(.*)|^(?!\")([^\s]*)\s(.*)|^\"(.*)\"|^(.*)
SOURCE_KEY = Opdrachtregel_proces
MV_ADD = false

[Process_path_exe]
CLEAN_KEYS = false
REGEX = (?<process_current_directory>.*\\)(?!\\)(?<process_exec>.*)
SOURCE_KEY = New_Process_Name
MV_ADD = false

[Process_path_exe_NL]
CLEAN_KEYS = false
REGEX = (?<process_current_directory>.*\\)(?!\\)(?<process_exec>.*)
SOURCE_KEY = Naam_van_nieuw_proces
MV_ADD = false

[Parent_process_dir_exe]
CLEAN_KEYS = false
REGEX = (?<parent_process_directory>.*\\)(?!\\)(?<parent_process_exec>.*)
SOURCE_KEY = Creator_Process_Name
MV_ADD = false

[script_info_from_process_parameters]
CLEAN_KEYS = false
REGEX = (?:(?=\w\:\\|\.\\|\.\/|\\|\/)(?<script_location>.*(?:\\|\/))|(?:\-file\s+|\-fil\s+|\-fi\s+|\-f\s+))(?!\\|\/)(?<script_file>[^\\\/\:\*\?\"\<\>\|]+\.(?:psc1|ps1|ps|bat|vbs|vbe|vbscript|vb|ws|wsf|wsh))
SOURCE_KEY = process_parameters

[object_name_to_path_and_file]
CLEAN_KEYS = false
SOURCE_KEY = Object_Name
REGEX = (?<object_path>.*?)(?:(?<object_file>[^\\\/\:\*\?\"\<\>\|]+\.[^\\\/\:\*\?\"\<\>\|]+)$|(?<object_file_hidden>\.[^\\\/\:\*\?\"\<\>\|]+)$|$)

# For some reason there isn't always a "-" in an empty field, and in those cases the value of that field is filled with the name of the next field
# Example: dest_nt_domain = "Failure Information:" (EventCode 4625)
# to prevent that the wel-col-kv regex (splunk/etc/system/default/transforms.conf)  needs to be changed
[wel-col-kv]
REGEX = (?=\w)([^:\n\r]+):[ \t]*(?![\n\t])([^\n\t]*)

# Also for some unknown reason, sometimes there is a "hard" enter missing and the end of a line. 
# When that happends the wel-eq-kv doesn't work because of the DELIMS option
[wel-eq-kv2]
SOURCE_KEY = _pre_msg
REGEX = (?m)^(?!\d)([^\=]+)\=(.*)$
CLEAN_KEYS = true
FORMAT = $1::$2
MV_ADD = false

[signature_id_from_signature_long]
CLEAN_KEYS = false
SOURCE_KEY = signature_long
REGEX = (?:.*?)(?:(?<signature_id>KB.*|[0-9\.]+)$|$)
MV_ADD = false

[DirService_src_ip]
CLEAN_KEYS = false
MV_ADD = true
REGEX = Client IP address\:(?:\s*\[|\s*)(?<src_ip>[^\[\:]+)(?:\]\:|\:)(?<src_port>\d+)
SOURCE_KEY = Message

[DirService_auth]
CLEAN_KEYS = false
MV_ADD = true
REGEX = authenticate as\:\s*(?<dest_nt_domain>[^\\\\]*)\\\\(?<user>[^\s]*)
SOURCE_KEY = Message

[DirService_binding]
CLEAN_KEYS = false
MV_ADD = true
REGEX = Binding Type\:\s*(?<Binding_Type>\d*)
SOURCE_KEY = Message
